 # Połączenie z bazą danych przy pomocy sqlAlchemy

https://github.com/Zuzia01/aibd2022

In [1]:
from sqlalchemy import create_engine

db_string = "postgresql://wbauer_adb:adb2020@pgsql-196447.vipserv.org:5432/wbauer_adb"

db = create_engine(db_string)
connection_sqlalchemy = db.connect()

Zapytanie do bazy i wypisanie wyników

In [18]:
result_set = db.execute("SELECT * FROM city")  
#for r in result_set:  
#    print(r)

 # Połączenie z bazą danych przy pomocy psycopg2 i pandas

In [3]:
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

Zapytanie do bazy i wypisanie wyników

In [4]:
df = pd.read_sql('select * from city',con=connection)
df

C:\Users\Zuzia\anaconda3\envs\zuzannabaran\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

     city_id                city  country_id         last_update
0          1  A Corua (La Corua)          87 2006-02-15 09:45:25
1          2                Abha          82 2006-02-15 09:45:25
2          3           Abu Dhabi         101 2006-02-15 09:45:25
3          4                Acua          60 2006-02-15 09:45:25
4          5               Adana          97 2006-02-15 09:45:25
..       ...                 ...         ...                 ...
595      596               Zaria          69 2006-02-15 09:45:25
596      597        Zeleznogorsk          80 2006-02-15 09:45:25
597      598         Zhezqazghan          51 2006-02-15 09:45:25
598      599            Zhoushan          23 2006-02-15 09:45:25
599      600          Ziguinchor          83 2006-02-15 09:45:25

[600 rows x 4 columns]

## Połączenie za pomocą sqlAlchemy i pandas

In [5]:
df = pd.read_sql('select * from city', con=connection_sqlalchemy)
df

     city_id                city  country_id         last_update
0          1  A Corua (La Corua)          87 2006-02-15 09:45:25
1          2                Abha          82 2006-02-15 09:45:25
2          3           Abu Dhabi         101 2006-02-15 09:45:25
3          4                Acua          60 2006-02-15 09:45:25
4          5               Adana          97 2006-02-15 09:45:25
..       ...                 ...         ...                 ...
595      596               Zaria          69 2006-02-15 09:45:25
596      597        Zeleznogorsk          80 2006-02-15 09:45:25
597      598         Zhezqazghan          51 2006-02-15 09:45:25
598      599            Zhoushan          23 2006-02-15 09:45:25
599      600          Ziguinchor          83 2006-02-15 09:45:25

[600 rows x 4 columns]

***Zadanie 1***

Ile kategorii filmów mamy w wypożyczalni?

In [6]:
res_set = db.execute("select * from category")  
category_num = 0
for r in res_set:  
    category_num += 1
    
print(category_num)

16

***Zadanie 2***

Wyświetl listę kategorii w kolejności alfabetycznej.

In [7]:
res_set = db.execute("select name from category order by name")  
for r in res_set:  
    print(r)

('Action',)
('Animation',)
('Children',)
('Classics',)
('Comedy',)
('Documentary',)
('Drama',)
('Family',)
('Foreign',)
('Games',)
('Horror',)
('Music',)
('New',)
('Sci-Fi',)
('Sports',)
('Travel',)

***Zadanie 3***

Znajdź najstarszy i najmłodszy film do wypożyczenia.

In [8]:
youngest = db.execute("select title, release_year from film order by release_year fetch first row only;")   
for i in youngest:
    print(i)
    
oldest = db.execute("select title, release_year from film order by release_year desc fetch first row only;")  
for i in oldest:
    print(i)

('Chamber Italian', 2006)
('Chamber Italian', 2006)

***Zadanie 4***

Ile wypożyczeń odbyło się między 2005-07-01 a 2005-08-01?

In [9]:
res_set = db.execute("select count(*) from rental where rental_date between '2005-07-01 00:00:00' and '2005-08-01 23:59:59'")  
for r in res_set:  
    print(r)

(7380,)

***Zadanie 5***

Ile wypożyczeń odbyło się między 2010-01-01 a 2011-02-01?

In [10]:
res_set = db.execute("select count(*) from rental where rental_date between '2010-01-01 00:00:00' and '2011-02-01 23:59:59'")  
for r in res_set:  
    print(r)

(0,)

***Zadanie 6***

Znajdź największą płatność wypożyczenia.

In [11]:
res_set = db.execute("select amount from payment order by amount desc limit 1")  
for r in res_set:  
    print(r)

(Decimal('11.99'),)

***Zadanie 7***

Znajdź wszystkich klientów z Polski, Nigerii lub Bangladeszu.

In [12]:
res_set = db.execute(""" select first_name, last_name, country.country from customer \
inner join address on customer.address_id \
= address.address_id inner join city on address.city_id \
= city.city_id inner join country on city.country_id \
= country.country_id where country = 'Poland' or country = 'Bangladesh' or country = 'Nigeria'""")
                       
for r in res_set:  
    print(r)

('Sonia', 'Gregory', 'Nigeria')
('Brian', 'Wyman', 'Poland')
('Sidney', 'Burleson', 'Poland')
('Rodney', 'Moeller', 'Nigeria')
('Stephen', 'Qualls', 'Bangladesh')
('Velma', 'Lucas', 'Nigeria')
('Marilyn', 'Ross', 'Nigeria')
('Elsie', 'Kelley', 'Nigeria')
('Gladys', 'Hamilton', 'Nigeria')
('Frank', 'Waggoner', 'Bangladesh')
('Marjorie', 'Tucker', 'Poland')
('Carol', 'Garcia', 'Nigeria')
('Leah', 'Curtis', 'Poland')
('Ruben', 'Geary', 'Poland')
('Olga', 'Jimenez', 'Nigeria')
('Bertha', 'Ferguson', 'Nigeria')
('Tracey', 'Barrett', 'Nigeria')
('Jo', 'Fowler', 'Nigeria')
('Johnnie', 'Chisholm', 'Poland')
('Wallace', 'Slone', 'Nigeria')
('Michelle', 'Clark', 'Bangladesh')
('Russell', 'Brinson', 'Poland')
('Jimmie', 'Eggleston', 'Poland')
('Constance', 'Reid', 'Nigeria')

***Zadanie 8***

Gdzie mieszkają członkowie personelu?

In [13]:
res_set = db.execute("""select distinct country from country where country_id in
(select country_id from city where city_id in
(select city_id from address where address_id in
(select address_id from staff)))""")  
for r in res_set:  
    print(r)

('Australia',)
('Canada',)

***Zadanie 9***

Ilu pracowników mieszka w Argentynie lub Hiszpanii?

In [14]:
res_set = db.execute("""select count(*) from staff where address_id in
(select address_id from address where city_id in
(select city_id from city where country_id in
(select country_id from country where country = 'Argentina' or country = 'Spain')))""")  
for r in res_set:  
    print(r)

(0,)

***Zadanie 10***

Jakie kategorie filmów zostały wypożyczone przez klientów?

In [15]:
res_set = db.execute("""select name from category where category_id in
(select category_id from film_category where film_id in
(select film_id from inventory where inventory_id in
(select inventory_id from rental where customer_id in
(select customer_id from customer))))
""")  
for r in res_set:  
    print(r)

('Action',)
('Animation',)
('Children',)
('Classics',)
('Comedy',)
('Documentary',)
('Drama',)
('Family',)
('Foreign',)
('Games',)
('Horror',)
('Music',)
('New',)
('Sci-Fi',)
('Sports',)
('Travel',)

***Zadanie 11***

Znajdź wszystkie kategorie filmów wypożyczonych w Ameryce.

In [16]:
res_set = db.execute("""select name from category where category_id in
(select category_id from film_category where film_id in
(select film_id from inventory where inventory_id in
(select inventory_id from rental where customer_id in
(select customer_id from customer where address_id in
(select address_id from address where city_id in
(select city_id from city where country_id in
(select country_id from country where country='United States')))))))
""")  
for r in res_set:  
    print(r)

('Action',)
('Animation',)
('Children',)
('Classics',)
('Comedy',)
('Documentary',)
('Drama',)
('Family',)
('Foreign',)
('Games',)
('Horror',)
('Music',)
('New',)
('Sci-Fi',)
('Sports',)
('Travel',)

***Zadanie 12***

Znajdź wszystkie tytuły filmów, w których grał: Olympia Pfeiffer lub Julia Zellweger lub Ellen Presley

In [17]:
res_set = db.execute("""select actor.first_name, actor.last_name, title from film \
inner join film_actor on film.film_id \
= film_actor.film_id inner join actor on film_actor.actor_id \
= actor.actor_id where first_name = 'Olympia'and last_name = 'Pfeiffer' 
or first_name = 'Julia'and last_name = 'Zellweger' 
or first_name = 'Ellen'and last_name = 'Presley'""")
for r in res_set:  
    print(r)

('Ellen', 'Presley', 'Bilko Anonymous')
('Ellen', 'Presley', 'Caribbean Liberty')
('Ellen', 'Presley', 'Casper Dragonfly')
('Ellen', 'Presley', 'Empire Malkovich')
('Ellen', 'Presley', 'Floats Garden')
('Ellen', 'Presley', 'Frogmen Breaking')
('Ellen', 'Presley', 'Homeward Cider')
('Ellen', 'Presley', 'Hyde Doctor')
('Ellen', 'Presley', 'Image Princess')
('Ellen', 'Presley', 'Jacket Frisco')
('Ellen', 'Presley', 'Microcosmos Paradise')
('Ellen', 'Presley', 'Network Peak')
('Ellen', 'Presley', 'Oscar Gold')
('Ellen', 'Presley', 'Pickup Driving')
('Ellen', 'Presley', 'Pinocchio Simon')
('Ellen', 'Presley', 'Private Drop')
('Ellen', 'Presley', 'Roots Remember')
('Ellen', 'Presley', 'Scarface Bang')
('Ellen', 'Presley', 'Secretary Rouge')
('Ellen', 'Presley', 'Spy Mile')
('Ellen', 'Presley', 'Streetcar Intentions')
('Ellen', 'Presley', 'Tadpole Park')
('Ellen', 'Presley', 'Treasure Command')
('Ellen', 'Presley', 'Turn Star')
('Ellen', 'Presley', 'Women Dorado')
('Olympia', 'Pfeiffer', 'Badman Dawn')
('Olympia', 'Pfeiffer', 'Chitty Lock')
('Olympia', 'Pfeiffer', 'Color Philadelphia')
('Olympia', 'Pfeiffer', 'Contact Anonymous')
('Olympia', 'Pfeiffer', 'Deep Crusade')
('Olympia', 'Pfeiffer', 'Effect Gladiator')
('Olympia', 'Pfeiffer', 'Express Lonely')
('Olympia', 'Pfeiffer', 'Firehouse Vietnam')
('Olympia', 'Pfeiffer', 'Fugitive Maguire')
('Olympia', 'Pfeiffer', 'Hanky October')
('Olympia', 'Pfeiffer', 'Ice Crossing')
('Olympia', 'Pfeiffer', 'Idols Snatchers')
('Olympia', 'Pfeiffer', 'Intolerable Intentions')
('Olympia', 'Pfeiffer', 'Magnolia Forrester')
('Olympia', 'Pfeiffer', 'Mars Roman')
('Olympia', 'Pfeiffer', 'Maude Mod')
('Olympia', 'Pfeiffer', 'Murder Antitrust')
('Olympia', 'Pfeiffer', 'None Spiking')
('Olympia', 'Pfeiffer', 'Others Soup')
('Olympia', 'Pfeiffer', 'Psycho Shrunk')
('Olympia', 'Pfeiffer', 'Santa Paris')
('Olympia', 'Pfeiffer', 'Sense Greek')
('Olympia', 'Pfeiffer', 'Storm Happiness')
('Olympia', 'Pfeiffer', 'Sweet Brotherhood')
('Olympia', 'Pfeiffer', 'Titanic Boondock')
('Olympia', 'Pfeiffer', 'Tourist Pelican')
('Olympia', 'Pfeiffer', 'Traffic Hobbit')
('Olympia', 'Pfeiffer', 'Wait Cider')
('Julia', 'Zellweger', 'Breakfast Goldfinger')
('Julia', 'Zellweger', 'Cranes Reservoir')
('Julia', 'Zellweger', 'Dares Pluto')
('Julia', 'Zellweger', 'Detective Vision')
('Julia', 'Zellweger', 'Divorce Shining')
('Julia', 'Zellweger', 'Hollow Jeopardy')
('Julia', 'Zellweger', 'Jeopardy Encino')
('Julia', 'Zellweger', 'Lambs Cincinatti')
('Julia', 'Zellweger', 'Majestic Floats')
('Julia', 'Zellweger', 'Minds Truman')
('Julia', 'Zellweger', 'Open African')
('Julia', 'Zellweger', 'Outlaw Hanky')
('Julia', 'Zellweger', 'Panky Submarine')
('Julia', 'Zellweger', 'Rider Caddyshack')
('Julia', 'Zellweger', 'Won Dares')
('Julia', 'Zellweger', 'Wyoming Storm')